// pages/answer/answer-1611asia.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    currentTab: 0,
    navbar: ['阅读', '文法', '数学1', '数学2'],
    array1: [
      '题号', '答案', 1, 'B', 2, 'D', 3, 'C', 4, 'D', 5, 'D', 6, 'A', 7, 'D', 8, 'A', 9, 'C', 10, 'C', 11, 'D', 12, 'C', 13, 'C', 14, 'A', 15, 'D', 16, 'D', 17, 'B', 18, 'B', 19, 'C', 20, 'B', 21, 'C', 22, 'D', 23, 'D', 24, 'A', 25, 'B', 26, 'A', 27, 'C', 28, 'C', 29, 'C', 30, 'D', 31, 'A', 32, 'A', 33, 'B', 34, 'B', 35, 'B', 36, 'C', 37, 'A', 38, 'A', 39, 'C', 40, 'C', 41, 'D', 42, 'B', 43, 'C', 44, 'D', 45, 'A', 46, 'B', 47, 'C', 48, 'B', 49, 'B', 50, 'B', 51, 'D', 52, 'D'],
    array2: [
      '题号', '答案', 1, 'A', 2, 'C', 3, 'B', 4, 'A', 5, 'C', 6, 'C', 7, 'D', 8, 'B', 9, 'B', 10, 'A', 11, 'A', 12, 'D', 13, 'B', 14, 'B', 15, 'A', 16, 'D', 17, 'D', 18, 'A', 19, 'B', 20, 'C', 21, 'B', 22, 'A', 23, 'D', 24, 'C', 25, 'B', 26, 'C', 27, 'C', 28, 'D', 29, 'C', 30, 'C', 31, 'A', 32, 'D', 33, 'D', 34, 'C', 35, 'B', 36, 'D', 37, 'D', 38, 'A', 39, 'D', 40, 'B', 41, 'A', 42, 'C', 43, 'D', 44, 'D'],
    array3: [
      '题号', '答案', 1, 'B', 2, 'B', 3, 'D', 4, 'B', 5, 'C', 6, 'D', 7, 'A', 8, 'C', 9, 'A', 10, 'D', 11, 'B', 12, 'A', 13, 'B', 14, 'C', 15, 'A', 16, '8', 17, '116', 18, '4', 19, '7', 20, '80'],
    array4: [
      '题号', '答案', 1, 'B', 2, 'C', 3, 'B', 4, 'A', 5, 'A', 6, 'C', 7, 'A', 8, 'D', 9, 'B', 10, 'C', 11, 'B', 12, 'C', 13, 'B', 14, 'C', 15, 'D', 16, 'D', 17, 'A', 18, 'A', 19, 'A', 20, 'B', 21, 'C', 22, 'C', 23, 'B', 24, 'C', 25, 'D', 26, 'D', 27, 'D', 28, 'A', 29, 'B', 30, 'D', 31, '15', 32, '1.38', 33, '0', 34, '2', 35, '8', 36, '183', 37, '35', 38, '77']
  },
  navbarTap: function (e) {
    this.setData({
      currentTab: e.currentTarget.dataset.idx
    })
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
    wx.setNavigationBarTitle({
      title: '1611亚太答案'
    })
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {
  
  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {
  
  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {
  
  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {
  
  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {
  
  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {
  
  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {
    return {
      title: '明志|赛达答案助手',
      path: '/pages/index/index'
    }
  }
})