// pages/answer/answer-1703na.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    currentTab: 0,
    navbar: ['阅读', '文法', '数学1', '数学2'],
    array1: [
      '题号', '答案', 1, 'D', 2, 'B', 3, 'C', 4, 'A', 5, 'B', 6, 'D', 7, 'D', 8, 'C', 9, 'D', 10, 'D', 11, 'B', 12, 'C', 13, 'B', 14, 'D', 15, 'C', 16, 'A', 17, 'A', 18, 'C', 19, 'D', 20, 'D', 21, 'A', 22, 'D', 23, 'D', 24, 'B', 25, 'D', 26, 'B', 27, 'C', 28, 'C', 29, 'B', 30, 'C', 31, 'A', 32, 'B', 33, 'A', 34, 'A', 35, 'B', 36, 'A', 37, 'C', 38, 'C', 39, 'D', 40, 'C', 41, 'B', 42, 'A', 43, 'A', 44, 'C', 45, 'A', 46, 'C', 47, 'D', 48, 'B', 49, 'B', 50, 'D', 51, 'D', 52, 'C'],
    array2: [
      '题号', '答案', 1, 'A', 2, 'B', 3, 'B', 4, 'A', 5, 'A', 6, 'D', 7, 'C', 8, 'D', 9, 'A', 10, 'A', 11, 'B', 12, 'C', 13, 'C', 14, 'D', 15, 'A', 16, 'A', 17, 'B', 18, 'C', 19, 'A', 20, 'C', 21, 'B', 22, 'C', 23, 'C', 24, 'D', 25, 'A', 26, 'B', 27, 'B', 28, 'A', 29, 'D', 30, 'D', 31, 'D', 32, 'C', 33, 'B', 34, 'B', 35, 'A', 36, 'C', 37, 'D', 38, 'C', 39, 'A', 40, 'B', 41, 'C', 42, 'A'],
    array3: [
      '题号', '答案', 1, 'C', 2, 'B', 3, 'D', 4, 'A', 5, 'B', 6, 'C', 7, 'C', 8, 'B', 9, 'B', 10, 'A', 11, 'B', 12, 'A', 13, 'C', 14, 'D', 15, 'A', 16, '6', 17, '1.8 or 9/5', 18, '0', 19, '32', 20, '3/5 or 0.6'],
    array4: [
      '题号', '答案', 1, 'A', 2, 'B', 3, 'B', 4, 'D', 5, 'D', 6, 'C', 7, 'A', 8, 'A', 9, 'D', 10, 'A', 11, 'D', 12, 'D', 13, 'D', 14, 'C', 15, 'B', 16, 'B', 17, 'A', 18, 'C', 19, 'D', 20, 'A', 21, 'A', 22, 'B', 23, 'C', 24, 'C', 25, 'C', 26, 'B', 27, 'C', 28, 'D', 29, 'B', 30, 'B', 31, '60', 32, '22', 33, '16', 34, '1582', 35, '5', 36, '1.44', 37, '9', 38, '13']
  },
  navbarTap: function (e) {
    this.setData({
      currentTab: e.currentTarget.dataset.idx
    })
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
    wx.setNavigationBarTitle({
      title: '1703北美答案'
    })
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {
  
  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {
  
  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {
  
  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {
  
  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {
  
  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {
  
  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {
    return {
      title: '明志|赛达答案助手',
      path: '/pages/index/index'
    }
  }
})