// pages/answer/answer-og4.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    currentTab: 0,
    navbar: ['阅读', '文法', '数学1', '数学2'],
    array1: [
      '题号', '答案', 1, 'C', 2, 'D', 3, 'D', 4, 'C', 5, 'A', 6, 'A', 7, 'B', 8, 'D', 9, 'D', 10, 'A', 11, 'C', 12, 'D', 13, 'A', 14, 'B', 15, 'A', 16, 'C', 17, 'C', 18, 'A', 19, 'B', 20, 'A', 21, 'D', 22, 'A', 23, 'C', 24, 'C', 25, 'B', 26, 'C', 27, 'A', 28, 'B', 29, 'B', 30, 'D', 31, 'D', 32, 'D', 33, 'D', 34, 'A', 35, 'B', 36, 'B', 37, 'D', 38, 'D', 39, 'D', 40, 'A', 41, 'B', 42, 'C', 43, 'B', 44, 'A', 45, 'D', 46, 'A', 47, 'D', 48, 'C', 49, 'D', 50, 'C', 51, 'B', 52, 'A'],
    array2: [
      '题号', '答案', 1, 'B', 2, 'B', 3, 'B', 4, 'A', 5, 'D', 6, 'B', 7, 'D', 8, 'B', 9, 'C', 10, 'A', 11, 'C', 12, 'D', 13, 'B', 14, 'D', 15, 'C', 16, 'C', 17, 'A', 18, 'C', 19, 'A', 20, 'C', 21, 'B', 22, 'D', 23, 'C', 24, 'C', 25, 'B', 26, 'D', 27, 'C', 28, 'A', 29, 'D', 30, 'B', 31, 'C', 32, 'B', 33, 'A', 34, 'C', 35, 'C', 36, 'B', 37, 'D', 38, 'A', 39, 'C', 40, 'B', 41, 'D', 42, 'D', 43, 'A', 44, 'B'],
    array3: [
      '题号', '答案', 1, 'A', 2, 'A', 3, 'A', 4, 'B', 5, 'C', 6, 'B', 7, 'D', 8, 'A', 9, 'D', 10, 'D', 11, 'C', 12, 'C', 13, 'B', 14, 'A', 15, 'B', 16, '9', 17, '0.6 or 3/5', 18, '5', 19, '0', 20, '25'],
    array4: [
      '题号', '答案', 1, 'B', 2, 'C', 3, 'C', 4, 'B', 5, 'B', 6, 'A', 7, 'A', 8, 'D', 9, 'B', 10, 'A', 11, 'A', 12, 'C', 13, 'C', 14, 'D', 15, 'B', 16, 'A', 17, 'D', 18, 'C', 19, 'A', 20, 'C', 21, 'C', 22, 'B', 23, 'B', 24, 'C', 25, 'B', 26, 'C', 27, 'D', 28, 'D', 29, 'B', 30, 'D', 31, '1160', 32, '1/2 or 0.5', 33, '4.55', 34, '150', 35, '2.25 or 9/4', 36, '29,30,31,32,33 or34', 37, '0.72', 38, '134']
  },
  navbarTap: function (e) {
    this.setData({
      currentTab: e.currentTarget.dataset.idx
    })
  },
  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
    wx.setNavigationBarTitle({
      title: 'OG4答案'
    })
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {
    return {
      title: '明志|赛达答案助手',
      path: '/pages/index/index'
    }
  }
})