// pages/answer/answer-og2.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    currentTab: 0,
    navbar: ['阅读', '文法', '数学1', '数学2'],
    array1: [
      '题号', '答案', 1, 'A', 2, 'B', 3, 'C', 4, 'A', 5, 'D', 6, 'B', 7, 'D', 8, 'D', 9, 'B', 10, 'D', 11, 'D', 12, 'D', 13, 'A', 14, 'B', 15, 'C', 16, 'A', 17, 'C', 18, 'C', 19, 'A', 20, 'B', 21, 'C', 22, 'C', 23, 'A', 24, 'B', 25, 'C', 26, 'B', 27, 'D', 28, 'D', 29, 'D', 30, 'B', 31, 'C', 32, 'B', 33, 'B', 34, 'A', 35, 'D', 36, 'B', 37, 'B', 38, 'D', 39, 'C', 40, 'A', 41, 'B', 42, 'D', 43, 'C', 44, 'B', 45, 'D', 46, 'C', 47, 'A', 48, 'B', 49, 'D', 50, 'D', 51, 'D', 52, 'A'],
    array2: [
      '题号', '答案', 1, 'B', 2, 'B', 3, 'A', 4, 'A', 5, 'D', 6, 'D', 7, 'B', 8, 'D', 9, 'B', 10, 'B', 11, 'C', 12, 'B', 13, 'D', 14, 'C', 15, 'C', 16, 'C', 17, 'B', 18, 'B', 19, 'A', 20, 'D', 21, 'D', 22, 'B', 23, 'A', 24, 'B', 25, 'B', 26, 'A', 27, 'D', 28, 'A', 29, 'C', 30, 'C', 31, 'D', 32, 'B', 33, 'D', 34, 'D', 35, 'A', 36, 'D', 37, 'A', 38, 'B', 39, 'C', 40, 'D', 41, 'D', 42, 'C', 43, 'C', 44, 'D'],
    array3: [
      '题号', '答案', 1, 'C', 2, 'B', 3, 'A', 4, 'A', 5, 'C', 6, 'D', 7, 'A', 8, 'C', 9, 'B', 10, 'C', 11, 'C', 12, 'B', 13, 'D', 14, 'A', 15, 'D', 16, '3,6 or 9', 17, '19', 18, '12', 19, '6', 20, '1/4 or 0.25'],
    array4: [
      '题号', '答案', 1, 'C', 2, 'B', 3, 'A', 4, 'C', 5, 'C', 6, 'B', 7, 'D', 8, 'D', 9, 'A', 10, 'B', 11, 'B', 12, 'D', 13, 'D', 14, 'C', 15, 'A', 16, 'B', 17, 'C', 18, 'C', 19, 'B', 20, 'C', 21, 'D', 22, 'B', 23, 'A', 24, 'A', 25, 'A', 26, 'D', 27, 'B', 28, 'B', 29, 'B', 30, 'A', 31, '14', 32, '7', 33, '11', 34, '105', 35, '15', 36, '32', 37, '3284', 38, '7500']
  },
  navbarTap: function (e) {
    this.setData({
      currentTab: e.currentTarget.dataset.idx
    })
  },
  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
    wx.setNavigationBarTitle({
      title: 'OG2答案'
    })
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {
    return {
      title: '明志|赛达答案助手',
      path: '/pages/index/index'
    }
  }
})