// pages/answer/answer-og7.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    currentTab: 0,
    navbar: ['阅读', '文法', '数学1', '数学2'],
    array1: [
      '题号', '答案', 1, 'D', 2, 'A', 3, 'A', 4, 'B', 5, 'D', 6, 'B', 7, 'C', 8, 'B', 9, 'D', 10, 'D', 11, 'D', 12, 'A', 13, 'A', 14, 'D', 15, 'D', 16, 'C', 17, 'D', 18, 'B', 19, 'D', 20, 'C', 21, 'B', 22, 'C', 23, 'A', 24, 'D', 25, 'C', 26, 'A', 27, 'C', 28, 'B', 29, 'C', 30, 'D', 31, 'B', 32, 'D', 33, 'B', 34, 'C', 35, 'B', 36, 'B', 37, 'C', 38, 'A', 39, 'C', 40, 'A', 41, 'A', 42, 'C', 43, 'D', 44, 'D', 45, 'C', 46, 'A', 47, 'C', 48, 'A', 49, 'A', 50, 'B', 51, 'A', 52, 'D'],
    array2: [
      '题号', '答案', 1, 'D', 2, 'A', 3, 'B', 4, 'A', 5, 'C', 6, 'C', 7, 'B', 8, 'D', 9, 'A', 10, 'D', 11, 'A', 12, 'D', 13, 'C', 14, 'A', 15, 'C', 16, 'D', 17, 'B', 18, 'C', 19, 'B', 20, 'D', 21, 'C', 22, 'C', 23, 'C', 24, 'A', 25, 'C', 26, 'D', 27, 'B', 28, 'D', 29, 'C', 30, 'B', 31, 'C', 32, 'C', 33, 'C', 34, 'A', 35, 'B', 36, 'C', 37, 'D', 38, 'C', 39, 'D', 40, 'B', 41, 'A', 42, 'D', 43, 'C', 44, 'A'],
    array3: [
      '题号', '答案', 1, 'C', 2, 'C', 3, 'B', 4, 'D', 5, 'A', 6, 'C', 7, 'B', 8, 'C', 9, 'B', 10, 'B', 11, 'D', 12, 'B', 13, 'D', 14, 'A', 15, 'D', 16, '8', 17, '30', 18, '4', 19, '8', 20, '6632'],
    array4: [
      '题号', '答案', 1, 'B', 2, 'A', 3, 'C', 4, 'D', 5, 'C', 6, 'C', 7, 'A', 8, 'C', 9, 'A', 10, 'D', 11, 'A', 12, 'B', 13, 'B', 14, 'D', 15, 'B', 16, 'D', 17, 'A', 18, 'B', 19, 'A', 20, 'C', 21, 'C', 22, 'B', 23, 'C', 24, 'A', 25, 'B', 26, 'B', 27, 'A', 28, 'C', 29, 'D', 30, 'B', 31, '195', 32, '2/5,0.4', 33, '30', 34, '5/18,0.277,0.278', 35, '0,3', 36, '6', 37, '2.4,12/5', 38, '5/7,0.714']
  },
  navbarTap: function (e) {
    this.setData({
      currentTab: e.currentTarget.dataset.idx
    })
  },
  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
    wx.setNavigationBarTitle({
      title: 'OG7答案'
    })
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {
    return {
      title: '明志|赛达答案助手',
      path: '/pages/index/index'
    }
  }
})