// pages/answer/answer-og3.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    currentTab: 0,
    navbar: ['阅读', '文法', '数学1', '数学2'],
    array1: [
      '题号', '答案', 1, 'B', 2, 'C', 3, 'A', 4, 'A', 5, 'C', 6, 'A', 7, 'A', 8, 'B', 9, 'B', 10, 'D', 11, 'A', 12, 'C', 13, 'D', 14, 'B', 15, 'B', 16, 'C', 17, 'B', 18, 'B', 19, 'A', 20, 'A', 21, 'D', 22, 'A', 23, 'A', 24, 'B', 25, 'C', 26, 'C', 27, 'B', 28, 'B', 29, 'D', 30, 'D', 31, 'B', 32, 'C', 33, 'C', 34, 'D', 35, 'C', 36, 'A', 37, 'D', 38, 'C', 39, 'A', 40, 'D', 41, 'A', 42, 'C', 43, 'C', 44, 'D', 45, 'D', 46, 'C', 47, 'B', 48, 'B', 49, 'A', 50, 'B', 51, 'D', 52, 'D'],
    array2: [
      '题号', '答案', 1, 'A', 2, 'B', 3, 'C', 4, 'C', 5, 'A', 6, 'B', 7, 'A', 8, 'D', 9, 'C', 10, 'C', 11, 'B', 12, 'A', 13, 'C', 14, 'D', 15, 'B', 16, 'C', 17, 'C', 18, 'B', 19, 'D', 20, 'C', 21, 'D', 22, 'A', 23, 'A', 24, 'D', 25, 'B', 26, 'A', 27, 'D', 28, 'B', 29, 'B', 30, 'B', 31, 'D', 32, 'B', 33, 'C', 34, 'D', 35, 'B', 36, 'C', 37, 'D', 38, 'C', 39, 'C', 40, 'B', 41, 'D', 42, 'A', 43, 'D', 44, 'D'],
    array3: [
      '题号', '答案', 1, 'C', 2, 'D', 3, 'D', 4, 'B', 5, 'C', 6, 'C', 7, 'C', 8, 'A', 9, 'A', 10, 'A', 11, 'B', 12, 'A', 13, 'B', 14, 'A', 15, 'D', 16, '1or2', 17, '2', 18, '105', 19, '370', 20, '3/5 or 0.6'],
    array4: [
      '题号', '答案', 1, 'C', 2, 'B', 3, 'C', 4, 'C', 5, 'B', 6, 'A', 7, 'D', 8, 'C', 9, 'B', 10, 'D', 11, 'B', 12, 'D', 13, 'D', 14, 'A', 15, 'A', 16, 'B', 17, 'B', 18, 'B', 19, 'C', 20, 'B', 21, 'C', 22, 'B', 23, 'C', 24, 'D', 25, 'D', 26, 'C', 27, 'C', 28, 'D', 29, 'A', 30, 'A', 31, '4 or 5', 32, '58.6', 33, '9', 34, '5/8 or 0.625', 35, '50', 36, '750', 37, '7', 38, '60']
  },
  navbarTap: function (e) {
    this.setData({
      currentTab: e.currentTarget.dataset.idx
    })
  },
  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
    wx.setNavigationBarTitle({
      title: 'OG3答案'
    })
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {
    return {
      title: '明志|赛达答案助手',
      path: '/pages/index/index'
    }
  }
})