// pages/answer/answer-1612na.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    currentTab: 0,
    navbar: ['阅读', '文法', '数学1', '数学2'],
    array1: [
      '题号', '答案', 1, 'D', 2, 'A', 3, 'A', 4, 'B', 5, 'C', 6, 'B', 7, 'C', 8, 'A', 9, 'D', 10, 'C', 11, 'D', 12, 'B', 13, 'B', 14, 'A', 15, 'A', 16, 'C', 17, 'B', 18, 'A', 19, 'C', 20, 'D', 21, 'B', 22, 'B', 23, 'A', 24, 'C', 25, 'D', 26, 'D', 27, 'C', 28, 'C', 29, 'D', 30, 'C', 31, 'C', 32, 'B', 33, 'A', 34, 'C', 35, 'B', 36, 'C', 37, 'D', 38, 'D', 39, 'B', 40, 'A', 41, 'D', 42, 'D', 43, 'D', 44, 'A', 45, 'C', 46, 'D', 47, 'A', 48, 'A', 49, 'B', 50, 'D', 51, 'C', 52, 'A'],
    array2: [
      '题号', '答案', 1, 'B', 2, 'C', 3, 'D', 4, 'A', 5, 'A', 6, 'D', 7, 'B', 8, 'D', 9, 'D', 10, 'C', 11, 'A', 12, 'D', 13, 'D', 14, 'B', 15, 'A', 16, 'C', 17, 'D', 18, 'D', 19, 'B', 20, 'C', 21, 'C', 22, 'A', 23, 'D', 24, 'A', 25, 'B', 26, 'A', 27, 'A', 28, 'C', 29, 'B', 30, 'A', 31, 'B', 32, 'C', 33, 'B', 34, 'B', 35, 'D', 36, 'D', 37, 'A', 38, 'D', 39, 'A', 40, '', 41, 'C', 42, 'C', 43, 'A', 44, 'B'],
    array3: [
      '题号', '答案', 1, 'A', 2, 'C', 3, 'C', 4, 'A', 5, 'C', 6, 'C', 7, 'B', 8, 'C', 9, 'B', 10, 'A', 11, 'A', 12, 'C', 13, 'A', 14, 'D', 15, '', 16, '120', 17, '21', 18, '62.5', 19, '2', 20, '54'],
    array4: [
      '题号', '答案', 1, 'B', 2, 'C', 3, 'A', 4, 'B', 5, 'B', 6, 'C', 7, 'D', 8, 'D', 9, 'D', 10, 'B', 11, 'D', 12, 'A', 13, 'A', 14, 'B', 15, 'C', 16, 'A', 17, 'A', 18, '', 19, '', 20, 'B', 21, 'C', 22, 'A', 23, 'C', 24, 'A', 25, 'B', 26, 'A', 27, 'B', 28, 'D', 29, 'B', 30, 'D', 31, '18', 32, '5', 33, '75', 34, '1275', 35, '15', 36, '9816', 37, '10', 38, '121']
  },
  navbarTap: function (e) {
    this.setData({
      currentTab: e.currentTarget.dataset.idx
    })
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
    wx.setNavigationBarTitle({
      title: '1612北美答案'
    })
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {
  
  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {
    
  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {
  
  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {
  
  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {
  
  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {
  
  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {
    return {
      title: '明志|赛达答案助手',
      path: '/pages/index/index'
    }
  }
})