// pages/answer/answer-og8.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    currentTab: 0,
    navbar: ['阅读', '文法', '数学1', '数学2'],
    array1: [
      '题号', '答案', 1, 'A', 2, 'C', 3, 'C', 4, 'D', 5, 'A', 6, 'D', 7, 'D', 8, 'B', 9, 'C', 10, 'B', 11, 'B', 12, 'D', 13, 'D', 14, 'A', 15, 'D', 16, 'B', 17, 'C', 18, 'B', 19, 'C', 20, 'A', 21, 'C', 22, 'A', 23, 'D', 24, 'A', 25, 'B', 26, 'D', 27, 'B', 28, 'A', 29, 'D', 30, 'C', 31, 'D', 32, 'B', 33, 'C', 34, 'B', 35, 'C', 36, 'B', 37, 'C', 38, 'D', 39, 'C', 40, 'A', 41, 'D', 42, 'A', 43, 'C', 44, 'A', 45, 'C', 46, 'A', 47, 'D', 48, 'B', 49, 'B', 50, 'C', 51, 'C', 52, 'C'],
    array2: [
      '题号', '答案', 1, 'D', 2, 'B', 3, 'C', 4, 'B', 5, 'D', 6, 'C', 7, 'B', 8, 'C', 9, 'A', 10, 'C', 11, 'A', 12, 'A', 13, 'D', 14, 'C', 15, 'C', 16, 'A', 17, 'D', 18, 'B', 19, 'D', 20, 'B', 21, 'B', 22, 'D', 23, 'A', 24, 'C', 25, 'C', 26, 'A', 27, 'C', 28, 'C', 29, 'B', 30, 'B', 31, 'B', 32, 'D', 33, 'D', 34, 'B', 35, 'D', 36, 'A', 37, 'B', 38, 'D', 39, 'B', 40, 'D', 41, 'A', 42, 'D', 43, 'A', 44, 'C'],
    array3: [
      '题号', '答案', 1, 'D', 2, 'A', 3, 'A', 4, 'C', 5, 'B', 6, 'B', 7, 'B', 8, 'D', 9, 'A', 10, 'C', 11, 'B', 12, 'D', 13, 'C', 14, 'C', 15, 'D', 16, '3', 17, '32', 18, '1.5,3/2', 19, '8', 20, '144'],
    array4: [
      '题号', '答案', 1, 'A', 2, 'C', 3, 'A', 4, 'C', 5, 'B', 6, 'D', 7, 'C', 8, 'B', 9, 'D', 10, 'C', 11, 'B', 12, 'C', 13, 'C', 14, 'D', 15, 'D', 16, 'B', 17, 'A', 18, 'C', 19, 'A', 20, 'B', 21, 'D', 22, 'A', 23, 'A', 24, 'D', 25, 'A', 26, 'C', 27, 'B', 28, 'D', 29, 'B', 30, 'B', 31, '102', 32, '2', 33, '30', 34, '25.4,127/5', 35, '2,8', 36, '0', 37, '576', 38, '0.8,4/5']
  },
  navbarTap: function (e) {
    this.setData({
      currentTab: e.currentTarget.dataset.idx
    })
  },
  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
    wx.setNavigationBarTitle({
      title: 'OG8答案'
    })
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {
    return {
      title: '明志|赛达答案助手',
      path: '/pages/index/index'
    }
  }
})