// pages/answer/answer-18006na.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    currentTab: 0,
    navbar: ['阅读', '文法', '数学1', '数学2'],
    array1: [
      '题号', '答案', 1, 'A', 2, 'D', 3, 'B', 4, 'B', 5, 'B', 6, 'D', 7, 'C', 8, 'D', 9, 'D', 10, 'A', 11, 'A', 12, 'C', 13, 'B', 14, 'D', 15, 'D', 16, 'A', 17, 'B', 18, 'C', 19, 'D', 20, 'B', 21, 'D', 22, 'B', 23, 'A', 24, 'C', 25, 'B', 26, 'A', 27, 'C', 28, 'D', 29, 'D', 30, 'A', 31, 'C', 32, 'A', 33, 'B', 34, 'B', 35, 'C', 36, 'B', 37, 'C', 38, 'A', 39, 'D', 40, 'A', 41, 'B', 42, 'C', 43, 'D', 44, 'A', 45, 'B', 46, 'D', 47, 'C', 48, 'C', 49, 'A', 50, 'C', 51, 'D', 52, 'B'],
    array2: [
      '题号', '答案', 1, 'B', 2, 'C', 3, 'A', 4, 'C', 5, 'C', 6, 'D', 7, 'A', 8, 'D', 9, 'B', 10, 'C', 11, 'A', 12, 'B', 13, 'A', 14, 'C', 15, 'B', 16, 'D', 17, 'B', 18, 'B', 19, 'B', 20, 'C', 21, 'A', 22, 'D', 23, 'D', 24, 'D', 25, 'C', 26, 'B', 27, 'D', 28, 'A', 29, 'A', 30, 'B', 31, 'C', 32, 'B', 33, 'B', 34, 'C', 35, 'D', 36, 'A', 37, 'B', 38, 'A', 39, 'D', 40, 'D', 41, 'D', 42, 'C', 43, 'B', 44, 'A'],
    array3: [
      '题号', '答案', 1, 'B', 2, 'A', 3, 'C', 4, 'C', 5, 'D', 6, 'C', 7, 'B', 8, 'D', 9, 'B', 10, 'A', 11, 'B', 12, 'C', 13, 'D', 14, 'B', 15, 'A', 16, '1or2 ', 17, '2.5', 18, '3', 19, '48', 20, '72'],
    array4: [
      '题号', '答案', 1, 'D', 2, 'B', 3, 'A', 4, 'B', 5, 'A', 6, 'C', 7, 'D', 8, 'B', 9, 'A', 10, 'C', 11, 'C', 12, 'B', 13, 'C', 14, 'D', 15, 'C', 16, 'C', 17, 'A', 18, 'D', 19, 'B', 20, 'A', 21, 'C', 22, 'D', 23, 'D', 24, 'B', 25, 'C', 26, 'B', 27, 'B', 28, 'C', 29, 'A', 30, 'D', 31, '400', 32, '6', 33, '5', 34, '32/3', 35, '20/3', 36, '9or10', 37, '3/4', 38, '11']
  },
  navbarTap: function (e) {
    this.setData({
      currentTab: e.currentTarget.dataset.idx
    })
  },
  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
    wx.setNavigationBarTitle({
      title: '1806北美答案'
    })
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {
    return {
      title: '明志|SAT有了这款神器就够了',
      path: '/pages/index/index'
    }
  }
})