// pages/answer/answer-1705asia.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    currentTab: 0,
    navbar: ['阅读', '文法', '数学1', '数学2'],
    array1: [
      '题号', '答案', 1, 'C', 2, 'A', 3, 'C', 4, 'B', 5, 'B', 6, 'A', 7, 'D', 8, 'C', 9, 'C', 10, 'A', 11, 'D', 12, 'D', 13, 'B', 14, 'B', 15, 'A', 16, 'A', 17, 'C', 18, 'D', 19, 'C', 20, 'B', 21, 'C', 22, 'C', 23, 'D', 24, 'A', 25, 'D', 26, 'C', 27, 'D', 28, 'A', 29, 'C', 30, 'C', 31, 'B', 32, 'A', 33, 'A', 34, 'B', 35, 'B', 36, 'D', 37, 'D', 38, 'C', 39, 'D', 40, 'A', 41, 'B', 42, 'C', 43, 'A', 44, 'B', 45, 'D', 46, 'C', 47, 'D', 48, 'B', 49, 'B', 50, 'C', 51, 'A', 52, 'C'],
    array2: ['题号', '答案', 1, 'A', 2, 'C', 3, 'B', 4, 'A', 5, 'B', 6, 'A', 7, 'B', 8, 'D', 9, 'C', 10, 'B', 11, 'D', 12, 'A', 13, 'B', 14, 'D', 15, 'C', 16, 'C', 17, 'A', 18, 'B', 19, 'A', 20, 'A', 21, 'C', 22, 'C', 23, 'A', 24, 'B', 25, 'C', 26, 'D', 27, 'B', 28, 'C', 29, 'B', 30, 'B', 31, 'D', 32, 'C', 33, 'A', 34, 'C', 35, 'D', 36, 'B', 37, 'C', 38, 'C', 39, 'B', 40, 'D', 41, 'A', 42, 'D', 43, 'C', 44, 'D'],
    array3: [
      '题号', '答案', 1, 'B', 2, 'B', 3, 'A', 4, 'C', 5, 'B', 6, 'D', 7, 'C', 8, 'A', 9, 'C', 10, 'A', 11, 'D', 12, 'D', 13, 'B', 14, 'B', 15, 'C', 16, '9', 17, '6,7,10', 18, '14', 19, '210', 20, '2,7'],
    array4: [
      '题号', '答案', 1, 'C', 2, 'A', 3, 'D', 4, 'C', 5, 'C', 6, 'D', 7, 'A', 8, 'B', 9, 'B', 10, 'C', 11, 'A', 12, 'C', 13, 'B', 14, 'C', 15, 'B', 16, 'D', 17, 'D', 18, 'B', 19, 'D', 20, 'B', 21, 'B', 22, 'A', 23, 'D', 24, 'C', 25, 'A', 26, 'C', 27, 'A', 28, 'D', 29, 'A', 30, 'D', 31, '11', 32, '10', 33, '1/2,0.5', 34, '2', 35, '20', 36, '65', 37, '88', 38, '2.1,21/10']
  },
  navbarTap: function (e) {
    this.setData({
      currentTab: e.currentTarget.dataset.idx
    })
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
    wx.setNavigationBarTitle({
      title: '1705亚太答案'
    })
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {
  
  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {
  
  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {
  
  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {
  
  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {
  
  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {
  
  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {
    return {
      title: '明志|赛达答案助手',
      path: '/pages/index/index'
    }
  }
})