// pages/answer/answer-og5.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    currentTab: 0,
    navbar: ['阅读', '文法', '数学1', '数学2'],
    array1: [
      '题号', '答案', 1, 'D', 2, 'C', 3, 'C', 4, 'A', 5, 'C', 6, 'A', 7, 'D', 8, 'B', 9, 'B', 10, 'B', 11, 'B', 12, 'A', 13, 'B', 14, 'D', 15, 'C', 16, 'A', 17, 'B', 18, 'B', 19, 'B', 20, 'A', 21, 'D', 22, 'A', 23, 'B', 24, 'A', 25, 'B', 26, 'C', 27, 'D', 28, 'B', 29, 'D', 30, 'B', 31, 'D', 32, 'B', 33, 'C', 34, 'B', 35, 'A', 36, 'B', 37, 'C', 38, 'A', 39, 'B', 40, 'D', 41, 'D', 42, 'C', 43, 'D', 44, 'D', 45, 'C', 46, 'B', 47, 'A', 48, 'C', 49, 'C', 50, 'A', 51, 'A', 52, 'B'],
    array2: [
      '题号', '答案', 1, 'C', 2, 'D', 3, 'B', 4, 'C', 5, 'A', 6, 'C', 7, 'D', 8, 'D', 9, 'B', 10, 'C', 11, 'C', 12, 'D', 13, 'D', 14, 'A', 15, 'B', 16, 'C', 17, 'C', 18, 'A', 19, 'D', 20, 'D', 21, 'A', 22, 'B', 23, 'B', 24, 'B', 25, 'A', 26, 'B', 27, 'D', 28, 'A', 29, 'C', 30, 'B', 31, 'C', 32, 'D', 33, 'A', 34, 'C', 35, 'B', 36, 'B', 37, 'D', 38, 'C', 39, 'D', 40, 'B', 41, 'D', 42, 'A', 43, 'A', 44, 'C'],
    array3: [
      '题号', '答案', 1, 'D', 2, 'A', 3, 'B', 4, 'C', 5, 'D', 6, 'A', 7, 'C', 8, 'A', 9, 'A', 10, 'B', 11, 'C', 12, 'D', 13, 'B', 14, 'C', 15, 'D', 16, '4', 17, '6/5 or1.2', 18, '21/4 or 5.25', 19, '2', 20, '97'],
    array4: [
      '题号', '答案', 1, 'D', 2, 'C', 3, 'A', 4, 'B', 5, 'C', 6, 'B', 7, 'A', 8, 'C', 9, 'B', 10, 'A', 11, 'A', 12, 'D', 13, 'D', 14, 'A', 15, 'A', 16, 'D', 17, 'D', 18, 'C', 19, 'B', 20, 'D', 21, 'A', 22, 'C', 23, 'D', 24, 'B', 25, 'D', 26, 'B', 27, 'C', 28, 'C', 29, 'B', 30, 'B', 31, '1492', 32, '29/3,9.66,9.67', 33, '7', 34, '9', 35, '13', 36, '80', 37, '43,43.5,44,87/2', 38, '6']
  },
  navbarTap: function (e) {
    this.setData({
      currentTab: e.currentTarget.dataset.idx
    })
  },
  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
    wx.setNavigationBarTitle({
      title: 'OG5答案'
    })
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {
    return {
      title: '明志|赛达答案助手',
      path: '/pages/index/index'
    }
  }
})