// pages/answer/answer-1805asia.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    currentTab: 0,
    navbar: ['阅读', '文法', '数学1', '数学2'],
    array1: [
      '题号', '答案', 1, 'B', 2, 'C', 3, 'A', 4, 'B', 5, 'B', 6, 'C', 7, 'A', 8, 'D', 9, 'D', 10, 'C', 11, 'C', 12, 'D', 13, 'C', 14, 'A', 15, 'C', 16, 'B', 17, 'A', 18, 'B', 19, 'C', 20, 'D', 21, 'B', 22, 'C', 23, 'C', 24, 'C', 25, 'A', 26, 'D', 27, 'C', 28, 'A', 29, 'A', 30, 'D', 31, 'B', 32, 'A', 33, 'B', 34, 'D', 35, 'B', 36, 'D', 37, 'D', 38, 'B', 39, 'A', 40, 'B', 41, 'D', 42, 'B', 43, 'C', 44, 'D', 45, 'B', 46, 'B', 47, 'C', 48, 'A', 49, 'C', 50, 'D', 51, 'D', 52, 'A'],
    array2: [
      '题号', '答案', 1, 'B', 2, 'C', 3, 'A', 4, 'D', 5, 'C', 6, 'D', 7, 'C', 8, 'C', 9, 'D', 10, 'A', 11, 'D', 12, 'B', 13, 'A', 14, 'D', 15, 'D', 16, 'C', 17, 'C', 18, 'A', 19, 'C', 20, 'D', 21, 'B', 22, 'B', 23, 'D', 24, 'B', 25, 'D', 26, 'B', 27, 'B', 28, 'D', 29, 'A', 30, 'A', 31, 'C', 32, 'B', 33, 'C', 34, 'A', 35, 'B', 36, 'A', 37, 'B', 38, 'C', 39, 'D', 40, 'B', 41, 'C', 42, 'C', 43, 'D', 44, 'A'],
    array3: [
      '题号', '答案', 1, 'C', 2, 'B', 3, 'A', 4, 'C', 5, 'C', 6, 'A', 7, 'C', 8, 'D', 9, 'C', 10, 'B', 11, 'D', 12, 'C', 13, 'A', 14, 'D', 15, 'D', 16, '6', 17, '2 or 3', 18, '28', 19, '13/4', 20, '108'],
    array4: [
      '题号', '答案', 1, 'B', 2, 'D', 3, 'C', 4, 'A', 5, 'C', 6, 'D', 7, 'D', 8, 'C', 9, 'C', 10, 'C', 11, 'B', 12, 'C', 13, 'A', 14, 'C', 15, 'B', 16, 'B', 17, 'A', 18, 'B', 19, 'D', 20, 'D', 21, 'C', 22, 'B', 23, 'B', 24, 'B', 25, 'D', 26, 'B', 27, 'B', 28, 'A', 29, 'D', 30, 'B', 31, '3', 32, '5', 33, '15', 34, '2.5', 35, '90', 36, '137,138', 37, '36', 38, '135']
  },
  navbarTap: function (e) {
    this.setData({
      currentTab: e.currentTarget.dataset.idx
    })
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
    wx.setNavigationBarTitle({
      title: '1805亚太答案'
    })
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {
  
  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {
  
  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {
  
  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {
  
  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {
  
  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {
  
  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {
    return {
      title: '明志|赛达答案助手',
      path: '/pages/index/index'
    }
  }
})