// pages/answer/answer-1711na.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    currentTab: 0,
    navbar: ['阅读', '文法', '数学1', '数学2'],
    array1: [
      '题号', '答案', 1, 'A', 2, 'B', 3, 'B', 4, 'C', 5, 'A', 6, 'B', 7, 'A', 8, 'D', 9, 'D', 10, 'A', 11, 'A', 12, 'B', 13, 'A', 14, 'D', 15, 'C', 16, 'C', 17, 'B', 18, 'B', 19, 'D', 20, 'D', 21, 'A', 22, 'C', 23, 'D', 24, 'D', 25, 'A', 26, 'C', 27, 'B', 28, 'A', 29, 'B', 30, 'B', 31, 'D', 32, 'C', 33, 'D', 34, 'D', 35, 'D', 36, 'B', 37, 'C', 38, 'B', 39, 'C', 40, 'B', 41, 'A', 42, 'C', 43, 'B', 44, 'C', 45, 'D', 46, 'C', 47, 'B', 48, 'A', 49, 'B', 50, 'C', 51, 'C', 52, 'D'],
    array2: [
      '题号', '答案', 1, 'C', 2, 'A', 3, 'A', 4, 'C', 5, 'C', 6, 'A', 7, 'C', 8, 'D', 9, 'C', 10, 'C', 11, 'B', 12, 'D', 13, 'D', 14, 'B', 15, 'C', 16, 'C', 17, 'C', 18, 'A', 19, 'A', 20, 'B', 21, 'B', 22, 'A', 23, 'D', 24, 'B', 25, 'D', 26, 'C', 27, 'A', 28, 'B', 29, 'B', 30, 'C', 31, 'B', 32, 'D', 33, 'D', 34, 'D', 35, 'C', 36, 'B', 37, 'A', 38, 'A', 39, 'D', 40, 'C', 41, 'B', 42, 'A', 43, 'B', 44, 'D'],
    array3: [
      '题号', '答案', 1, 'A', 2, 'A', 3, 'B', 4, 'C', 5, 'C', 6, 'D', 7, 'A', 8, 'A', 9, 'B', 10, 'D', 11, 'B', 12, 'D', 13, 'D', 14, 'C', 15, 'C', 16, '35', 17, '2.5', 18, '5', 19, '10', 20, '19/3'],
    array4: [
      '题号', '答案', 1, 'C', 2, 'B', 3, 'B', 4, 'B', 5, 'C', 6, 'D', 7, 'B', 8, 'C', 9, 'A', 10, 'D', 11, 'D', 12, 'B', 13, 'C', 14, 'A', 15, 'B', 16, 'D', 17, 'B', 18, 'D', 19, 'C', 20, 'D', 21, 'B', 22, 'C', 23, 'A', 24, 'A', 25, 'B', 26, 'D', 27, 'A', 28, 'A', 29, 'A', 30, 'D', 31, '20', 32, '2400', 33, '7', 34, '3 or 4 or 5 ', 35, '22', 36, '5/4', 37, '14', 38, '277 or 287 or 297']
  },
  navbarTap: function (e) {
    this.setData({
      currentTab: e.currentTarget.dataset.idx
    })
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
    wx.setNavigationBarTitle({
      title: '1711北美答案'
    })
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {
  
  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {
  
  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {
  
  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {
  
  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {
  
  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {
  
  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {
    return {
      title: '明志|赛达答案助手',
      path: '/pages/index/index'
    }
  }
})