// pages/answer/answer-1803na.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    currentTab: 0,
    navbar: ['阅读', '文法', '数学1', '数学2'],
    array1: [
      '题号', '答案', 1, 'C', 2, 'D', 3, 'B', 4, 'D', 5, 'B', 6, 'B', 7, 'C', 8, 'D', 9, 'A', 10, 'C', 11, 'C', 12, 'A', 13, 'B', 14, 'C', 15, 'D', 16, 'B', 17, 'B', 18, 'D', 19, 'B', 20, 'D', 21, 'D', 22, 'B', 23, 'A', 24, 'B', 25, 'D', 26, 'D', 27, 'B', 28, 'B', 29, 'C', 30, 'A', 31, 'D', 32, 'A', 33, 'A', 34, 'C', 35, 'C', 36, 'C', 37, 'D', 38, 'A', 39, 'B', 40, 'B', 41, 'A', 42, 'A', 43, 'A', 44, 'C', 45, 'B', 46, 'C', 47, 'D', 48, 'C', 49, 'A', 50, 'A', 51, 'A', 52, 'D'],
    array2: [
      '题号', '答案', 1, 'C', 2, 'D', 3, 'C', 4, 'C', 5, 'A', 6, 'C', 7, 'A', 8, 'A', 9, 'B', 10, 'B', 11, 'D', 12, 'D', 13, 'C', 14, 'B', 15, 'B', 16, 'D', 17, 'A', 18, 'D', 19, 'B', 20, 'A', 21, 'B', 22, 'B', 23, 'B', 24, 'C', 25, 'B', 26, 'D', 27, 'C', 28, 'D', 29, 'A', 30, 'B', 31, 'C', 32, 'C', 33, 'D', 34, 'A', 35, 'D', 36, 'D', 37, 'B', 38, 'B', 39, 'D', 40, 'A', 41, 'D', 42, 'C', 43, 'B', 44, 'A'],
    array3: [
      '题号', '答案', 1, 'B', 2, 'C', 3, 'B', 4, 'A', 5, 'A', 6, 'B', 7, 'A', 8, 'B', 9, 'A', 10, 'D', 11, 'D', 12, 'A', 13, 'A', 14, 'D', 15, 'C', 16, '4', 17, '1/2,0.5', 18, '2', 19, '3', 20, '100'],
    array4: [
      '题号', '答案', 1, 'C', 2, 'A', 3, 'C', 4, 'B', 5, 'A', 6, 'B', 7, 'A', 8, 'A', 9, 'B', 10, 'C', 11, 'D', 12, 'C', 13, 'B', 14, 'C', 15, 'A', 16, 'C', 17, 'D', 18, 'C', 19, 'D', 20, 'A', 21, 'C', 22, 'B', 23, 'B', 24, 'B', 25, 'D', 26, 'A', 27, 'A', 28, 'C', 29, 'B', 30, 'D', 31, '23/2,11.5', 32, '160', 33, '48', 34, '5/3,1.66,1.67', 35, '7/4,1.75', 36, '4', 37, '50', 38, '99']
  },
  navbarTap: function (e) {
    this.setData({
      currentTab: e.currentTarget.dataset.idx
    })
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
    wx.setNavigationBarTitle({
      title: '1803北美答案'
    })
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {
  
  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {
  
  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {
  
  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {
  
  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {
  
  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {
  
  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {
    return {
      title: '明志|赛达答案助手',
      path: '/pages/index/index'
    }
  }
})