// pages/answer/answer-1805na.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    currentTab: 0,
    navbar: ['阅读', '文法', '数学1', '数学2'],
    array1: [
      '题号', '答案', 1, 'D', 2, 'B', 3, 'A', 4, 'D', 5, 'D', 6, 'B', 7, 'A', 8, 'A', 9, 'C', 10, 'A', 11, 'B', 12, 'C', 13, 'A', 14, 'B', 15, 'B', 16, 'C', 17, 'D', 18, 'B', 19, 'C', 20, 'B', 21, 'C', 22, 'D', 23, 'C', 24, 'A', 25, 'C', 26, 'A', 27, 'C', 28, 'C', 29, 'D', 30, 'B', 31, 'A', 32, 'C', 33, 'D', 34, 'B', 35, 'D', 36, 'B', 37, 'D', 38, 'D', 39, 'A', 40, 'D', 41, 'D', 42, 'D', 43, 'C', 44, 'A', 45, 'C', 46, 'A', 47, 'D', 48, 'B', 49, 'C', 50, 'A', 51, 'D', 52, 'C'],
    array2: [
      '题号', '答案', 1, 'D', 2, 'B', 3, 'C', 4, 'B', 5, 'A', 6, 'D', 7, 'B', 8, 'B', 9, 'D', 10, 'A', 11, 'B', 12, 'A', 13, 'D', 14, 'C', 15, 'B', 16, 'D', 17, 'D', 18, 'B', 19, 'C', 20, 'D', 21, 'D', 22, 'C', 23, 'B', 24, 'D', 25, 'A', 26, 'D', 27, 'D', 28, 'A', 29, 'B', 30, 'B', 31, 'C', 32, 'C', 33, 'A', 34, 'D', 35, 'C', 36, 'B', 37, 'B', 38, 'A', 39, 'C', 40, 'C', 41, 'A', 42, 'B', 43, 'C', 44, 'A'],
    array3: [
      '题号', '答案', 1, 'C', 2, 'D', 3, 'B', 4, 'D', 5, 'A', 6, 'A', 7, 'B', 8, 'C', 9, 'C', 10, 'A', 11, 'D', 12, 'A', 13, 'A', 14, 'B', 15, 'D', 16, '5/2 or 2.5', 17, '1/2 or 0.5', 18, '17/2 or 8.5', 19, '5/13,0.384 or 0.385', 20, '78'],
    array4: [
      '题号', '答案', 1, 'D', 2, 'C', 3, 'C', 4, 'A', 5, 'B', 6, 'B', 7, 'C', 8, 'A', 9, 'C', 10, 'B', 11, 'A', 12, 'B', 13, 'D', 14, 'C', 15, 'A', 16, 'B', 17, 'C', 18, 'D', 19, 'A', 20, 'D', 21, 'B', 22, 'B', 23, 'C', 24, 'A', 25, 'B', 26, 'C', 27, 'C', 28, 'B', 29, 'D', 30, 'D', 31, '11', 32, '4', 33, '125', 34, '1.7 or 17/10', 35, '44/7, 6.28 or 6.29', 36, '8', 37, '9', 38, '7/30 or 0.233']
  },
  navbarTap: function (e) {
    this.setData({
      currentTab: e.currentTarget.dataset.idx
    })
  },
  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
    wx.setNavigationBarTitle({
      title: '1805北美答案'
    })
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {
  
  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {
  
  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {
  
  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {
  
  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {
  
  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {
  
  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {
    return {
      title: '明志|赛达答案助手',
      path: '/pages/index/index'
    }
  }
})