// pages/answer/answer-1712na.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    currentTab: 0,
    navbar: ['阅读', '文法', '数学1', '数学2'],
    array1: [
      '题号', '答案', 1, 'A', 2, 'C', 3, 'B', 4, 'A', 5, 'D', 6, 'A', 7, 'B', 8, 'D', 9, 'C', 10, 'B', 11, 'C', 12, 'A', 13, 'A', 14, 'C', 15, 'B', 16, 'D', 17, 'A', 18, 'C', 19, 'B', 20, 'A', 21, 'A', 22, 'C', 23, 'B', 24, 'C', 25, 'C', 26, 'A', 27, 'B', 28, 'C', 29, 'C', 30, 'D', 31, 'D', 32, 'B', 33, 'D', 34, 'C', 35, 'D', 36, 'B', 37, 'D', 38, 'A', 39, 'B', 40, 'D', 41, 'A', 42, 'C', 43, 'C', 44, 'D', 45, 'B', 46, 'B', 47, 'D', 48, 'D', 49, 'C', 50, 'C', 51, 'D', 52, 'B'],
    array2: [
      '题号', '答案', 1, 'D', 2, 'B', 3, 'B', 4, 'D', 5, 'D', 6, 'C', 7, 'A', 8, 'A', 9, 'C', 10, 'D', 11, 'A', 12, 'C', 13, 'D', 14, 'B', 15, 'C', 16, 'C', 17, 'B', 18, 'C', 19, 'D', 20, 'D', 21, 'B', 22, 'A', 23, 'A', 24, 'D', 25, 'C', 26, 'A', 27, 'D', 28, 'A', 29, 'B', 30, 'B', 31, 'C', 32, 'C', 33, 'A', 34, 'B', 35, 'D', 36, 'B', 37, 'C', 38, 'D', 39, 'A', 40, 'A', 41, 'B', 42, 'D', 43, 'C', 44, 'A'],
    array3: [
      '题号', '答案', 1, 'C', 2, 'A', 3, 'D', 4, 'B', 5, 'A', 6, 'D', 7, 'D', 8, 'C', 9, 'B', 10, 'A', 11, 'C', 12, 'A', 13, 'D', 14, 'C', 15, 'B', 16, '21', 17, '2', 18, '5', 19, '8', 20, '34'],
    array4: [
      '题号', '答案', 1, 'D', 2, 'B', 3, 'C', 4, 'D', 5, 'B', 6, 'D', 7, 'A', 8, 'C', 9, 'B', 10, 'D', 11, 'C', 12, 'A', 13, 'C', 14, 'A', 15, 'A', 16, 'C', 17, 'D', 18, 'C', 19, 'A', 20, 'D', 21, 'A', 22, 'B', 23, 'C', 24, 'D', 25, 'B', 26, 'A', 27, 'D', 28, 'B', 29, 'C', 30, 'A', 31, '9250', 32, '5 or 10', 33, '24', 34, '14', 35, '0.17', 36, '12 or 4', 37, '1/70', 38, '20']
  },
  navbarTap: function (e) {
    this.setData({
      currentTab: e.currentTarget.dataset.idx
    })
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
    wx.setNavigationBarTitle({
      title: '1712北美答案'
    })
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {
  
  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {
  
  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {
  
  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {
  
  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {
  
  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {
  
  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {
  
  }
})