// pages/answer/answer-1705na.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    currentTab: 0,
    navbar: ['阅读', '文法', '数学1', '数学2'],
    array1: [
      '题号', '答案', 1, 'D', 2, 'B', 3, 'B', 4, 'A', 5, 'B', 6, 'B', 7, 'C', 8, 'C', 9, 'B', 10, 'A', 11, 'C', 12, 'B', 13, 'D', 14, 'B', 15, 'D', 16, 'B', 17, 'B', 18, 'C', 19, 'A', 20, 'C', 21, 'A', 22, 'A', 23, 'C', 24, 'A', 25, 'B', 26, 'C', 27, 'A', 28, 'B', 29, 'D', 30, 'D', 31, 'A', 32, 'C', 33, 'C', 34, 'A', 35, 'A', 36, 'B', 37, 'C', 38, 'D', 39, 'D', 40, 'A', 41, 'C', 42, 'A', 43, 'B', 44, 'D', 45, 'D', 46, 'C', 47, 'D', 48, 'D', 49, 'A', 50, 'D', 51, 'B', 52, 'C'],
    array2: [
      '题号', '答案', 1, 'C', 2, 'B', 3, 'A', 4, 'D', 5, 'D', 6, 'B', 7, 'A', 8, 'C', 9, 'B', 10, 'D', 11, 'C', 12, 'A', 13, 'B', 14, 'D', 15, 'B', 16, 'D', 17, 'A', 18, 'A', 19, 'C', 20, 'A', 21, 'C', 22, 'B', 23, 'B', 24, 'D', 25, 'D', 26, 'C', 27, 'B', 28, 'C', 29, 'A', 30, 'B', 31, 'D', 32, 'C', 33, 'C', 34, 'B', 35, 'D', 36, 'B', 37, 'D', 38, 'B', 39, 'D', 40, 'A', 41, 'B', 42, 'C', 43, 'D', 44, 'A'],
    array3: [
      '题号', '答案', 1, 'D', 2, 'B', 3, 'B', 4, 'B', 5, 'C', 6, 'C', 7, 'B', 8, 'A', 9, 'A', 10, 'D', 11, 'D', 12, 'A', 13, 'D', 14, 'A', 15, 'C', 16, '16', 17, '10', 18, '9/2 or 4.5', 19, '6', 20, '1.2 or 6/5'],
    array4: [
      '题号', '答案', 1, 'A', 2, 'C', 3, 'D', 4, 'A', 5, 'A', 6, 'B', 7, 'C', 8, 'A', 9, 'C', 10, 'B', 11, 'C', 12, 'B', 13, 'A', 14, 'D', 15, 'D', 16, 'C', 17, 'B', 18, 'C', 19, 'C', 20, 'D', 21, 'A', 22, 'D', 23, 'C', 24, 'B', 25, 'D', 26, 'D', 27, 'A', 28, 'D', 29, 'A', 30, 'C', 31, '5', 32, '30', 33, '27.4', 34, 'between 0 and 1', 35, '11', 36, '2.5 or 5/2', 37, '1/4 or 0.25', 38, '2']
  },
  navbarTap: function (e) {
    this.setData({
      currentTab: e.currentTarget.dataset.idx
    })
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
    wx.setNavigationBarTitle({
      title: '1705北美答案'
    })
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {
  
  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {
  
  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {
  
  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {
  
  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {
  
  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {
  
  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {
    return {
      title: '明志|赛达答案助手',
      path: '/pages/index/index'
    }
  }
})